Revit 2027 API
RebarHostData.GetRebarContainersInHost Method
 Returns all RebarContainer elements hosted by the referenced element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<RebarContainer> GetRebarContainersInHost()
Public Function GetRebarContainersInHost As IList(Of RebarContainer)
public:
IList<RebarContainer^>^ GetRebarContainersInHost()
member GetRebarContainersInHost : unit -> IList<RebarContainer>
Return Value
IList<RebarContainer>
See Also
Reference
RebarHostData Class
Autodesk.Revit.DB.Structure Namespace